{
  "andrew_ryan.pdf": "Andrew Ryan\nEducation\nBrooklyn Technical High School\nBrooklyn, NY\nGPA 3.76, Class rank 63/350, SAT 1510\nSept. 2021 – Jun 2025\nExtracurricular Activities\nStudent Government\nSept. 2023 – Jun. 2024\nTreasurer\nBrooklyn, NY\n• Developed budget proposals, collaborating with the student government team to plan major school events.\n• Organized and led fundraising events, raising over $5,000 for school activities and projects.\n• Managed the student government budget, ensuring accurate tracking and allocation of funds.\nMath Team\nSept. 2022 – Present\nTeam Captain\nBrooklyn, NY\n• Competed in regional, state, and national-level math competitions(NYCIML, NYCMTS).\n• Facilitated weekly study sessions to discuss high-level Probability Theory, Geometry & Algebra.\n• Led a 26-member math team as captain, overseeing strategy development and competition preparation.\nVarsity Swim Team\nSep. 2021 – June 2024\nTeam Captain\nBrooklyn, NY\n• Led the varsity swim team to its inaugural section championship through leadership and strategic planning.\n• Mentored junior team members, providing guidance on proper techniques, race preparation, and sportsmanship.\nExperience\nFlexiDip\nJune 2024 – Present\nCo-Founder\nAnn Arbor, MI\n• Co-founded startup specializing in adjustable dipping containers, optimizing buffalo wing dining experience.\n• Developed minimum viable product(MVP) capable of early-stage revenue generation.\n• Received positive feedback from established brands like Buffalo Wild Wings for innovative sauce holder designs.\n• Validated startup idea through market research and interview feedback as a part of Launch-X U-Michigan.\nPrivate Math Tutor\nSept. 2021 – Present\nTeam Captain\nBrooklyn, NY\n• Provided personalized tutoring sessions in algebra, calculus, and geometry to elementary & middle-school students\n• Developed lesson plans for diverse learning styles, leading to improvements by upwards of 1.5 letter grades.\nAwards\nSpeedo Scholastic All-American\nAug. 2023 – Present\n• National award given to student-athletes who achieve a national time standard while maintaining a 3.5+ GPA.\nNational Junior Honor Society\nJune 2023 – Present\n• Award presented to students with outstanding achievements in academics, leadership, and community service.\nClasses\nCourses: AP Calulus BC, AP Chemistry, AP Physics, AP World History, AP U.S. History, AP Statistics, AP Literature\nSkills & Interests\nSkills: Probability Theory, Web Design, Microsoft Excel, Microsoft Office\nInterests: Photography, Creative Writing, Archery, New York Knicks\n123-456-7890 | andrew@gmail.com | linkedin.com/in/andrew\n",
  "anish_resume.pdf": " Name: Anish Thawait​\n Phone: 9301712264​\n Email: anish8878661204@gmail.com \n \nCareer Objective \nEnthusiastic and dedicated 12th pass student seeking a position at your company to gain \nvaluable work experience, improve communication skills, and contribute positively to \ncustomer service operations. Eager to learn and grow in a fast-paced environment. \n \nEducation \nSenior Secondary (12th Standard)​\n MGM Senior Secondary School, CBSE​\n Year of Passing: 2024​\n Percentage: 60% \nSecondary School (10th Standard)​\n MGM Senior Secondary School, CBSE​\n Year of Passing: 2022​\n Percentage: 70% \n \nSkills \n●​ Good verbal and written communication. \n●​ Basic computer knowledge (MS Word, Excel, Email) \n●​ Polite and patient with customers \n●​ Fast learner and good listener \n●​ Ability to work in a team environment \nLanguages Known \n●​ English (Fluent)             Hindi (Fluent) \nExtra-Curricular Activities \n●​ Participated in school sports competitions \n●​ Volunteered in school events and community programs​\n \n \n",
  "anubhav_singh.pdf": "Anubhav Singh\nEmail: xprilion@gmail.com\nPortfolio: xprilion.com\nMobile:\n+91-XXX-XXXX-XXX\nGithub:\ngithub.com/xprilion\nEducation\n• Netaji Subhash Engineering College\nKolkata, India\nBachelor of Technology - Information Technology; GPA: 7.27\nJuly 2016 - June 2020\nCourses: Operating Systems, Data Structures, Analysis Of Algorithms, Artificial Intelligence, Machine Learning, Networking, Databases\nSkills Summary\n• Languages:\nPython, PHP, C++, JavaScript, SQL, Bash, JAVA\n• Frameworks:\nScikit, NLTK, SpaCy, TensorFlow, Keras, Django, Flask, NodeJS, LAMP\n• Tools:\nKubernetes, Docker, GIT, PostgreSQL, MySQL, SQLite\n• Platforms:\nLinux, Web, Windows, Arduino, Raspberry, AWS, GCP, Alibaba Cloud, IBM Cloud\n• Soft Skills:\nLeadership, Event Management, Writing, Public Speaking, Time Management\nExperience\n• Google Summer of Code - Submitty\nRemote\nStudent Developer (Full-time)\nMay 2019 - Sep 2019\n◦Discussion Forum Upgrades: Refactor forum for performance to handle large databases.\n◦REST API for Discussion Forum: Symphony & Twig based Forum parts converted to API-first interface.\n◦Ratchet PHP WebSocket: Implemented a WebSocket for low-latency real time exchange of posts and thread updates.\n• DataCamp Inc.\nRemote\nInstructor (Part-time, Contractual)\nDec 2018 - Present\n◦Project Course - Find Movie Similarity from Plot Summaries: Created project based course using Unsupervised\nlearning and natural language processing.\n◦Tutorial - Introduction to Reinforcement Learning: Created tutorial for Q-learning RL algorithm and concepts.\n◦Impact: Course has been taken by 250+ students so far with 4.65 average rating.\nProjects\n• Vison - multimedia search engine (NLP, Search Engine, Web Crawlers, Multimedia Processing): (Work in\nprogress) Research oriented, open source, search engine for bringing reverse multimedia search to small & mid scale enterprises.\nTech: Python, NodeJS, Intel OpenVino Toolkit, Selenium, TensorFlow (October ’18)\n• Reinforcement Learning based Traffic Control System (Reinforcement Learning, Computer Vision): AI model\nto resolve city traffic around 50% faster. Tech: Python, Alibaba Cloud, Raspberry Pi, Arduino, SUMO & OpenCV. (August\n’18)\n• Panorama from Satellite Imagery using Distributed Computing (Distributed Computing, Image Processing):\nImages clicked using drones, provided by ISRO were stitched together using distributed public compute nodes, effectively\nbringing down processing time exponentially. Tech: PHP, C++, Java, Python (March ’18)\n• Drag-n-drop machine learning learning environment (Web Development, Machine Learning): Scratch like tool\nfor implementing machine learning pipelines along with built in tutorial for each concept. Tech: Python, JavaScript\n(September ’18)\n• Search Engine and Social Network(Web Development, Web Crawler, Search): Created from scratch a social\nnetwork and a search engine based on the idea of integrating Facebook and Google. The launched website was among top 1000\nwebsites in India during 2012-2013. Tech: PHP, MySQL, HTML, CSS, WebSockets, JavaScript, RSS, XML ( May ’12)\nPublications\n• Book: Deep Learning on Web (Web Development, Deep Learning): Work in Progress book to be published by Packt\nPublishing in late 2019. Tech: Django, Python, AWS, GCP, Azure (November ’18)\n• Book: Deep Learning on Mobile Devices (Flutter App Development, Deep Learning): Work in Progress book to\nbe published by Packt Publishing in late 2019. Tech: Flutter, Android, Firebase, TensorFlow, Python, Dart (December ’18)\nHonors and Awards\n• Awarded title of Intel Software Innovator - May, 2019\n• Second Runner’s Up at TCS EngiNx Engineering Project Innovation Content - September, 2018\n• Runner’s Up at Facebook Developers Circle Hackathon - August, 2017\nVolunteer Experience\n• Community Lead at Developer Student Clubs NSEC\nKolkata, India\nConducted online and offline technical & soft-skills training impacting over 3000 students.\nJan 2019 - Present\n• Event Organizer at Google Developers Group Kolkata\nKolkata, India\nOrganized events, conducted workshops and delivered workshops reaching over 7000 developers.\nJan 2018 - Present\n",
  "carl_johnson.pdf": "Carl Johnson (CJ)\nResidence/domicile: 113, Groove Street\nE-mail: pleasedonotcontactme@gmail.com ✼Telephone number: +1-202-555-0100\nPlace of birth: Ariccia, Italy ✼Date of birth: 08-11-1968\nEducation\nMaster’s degree in Memeology and Unicorn Analytics\nFaber College\nMaster’s degree program\nFebruary 2019 - April 2020\nGraduated with honors\nThesis title: A deep learning approach to predicting the next Brexit: Unicorns vs. White Walkers\nBachelor’s degree in Absurd Robotics Engineering\nWesteros University\nBachelor’s degree program\nMay 2016 - August 2018\nFinal grade: 9,001/10,000\nCapstone project: Design and implementation of a robot that makes toast using a flamethrower\nHigh School Diploma\nRydell High School\nHigh school’s diploma program\nJune 2011 - May 2015\nFinal grade: 7/7\nSenior project: Applying machine learning techniques to predict students’ failure rates based on their\nmeme consumption habits\nWork experience\nDank Memes Inc.\nSeptember 2019 - September 2021\nHead of ”Machine Learning for Absurd Stuff” Department\nAriccia, Italy\n•\nDeveloped state-of-the-art predictive models for next-generation memes.\n•\nApplied machine learning techniques to optimize unicorn-mounted laser systems.\n•\nStreamlined internal meme generation pipelines.\nViral News Robotics Laboratory (VNRL)\nMarch 2019 - July 2019\nRobotics Comedian Intern\nFries, Virginia\n•\nEngineered a robotic Tyrion Lannister that repeatedly asks, ”Where’s the wine?”\nLibrary of Alexandria 2.0\nJanuary 2017 - April 2018\nNovelist\nCut and Shoot, Texas\n•\nCurated the ”Dumb & Dumber Guide to Classic Literature”, featuring ”Fifty Smudges of Gray”,\n”Pride and Prejudice: smart girls can always find a way to rationalize marrying for money”\n•\nHosted a weekly meme reading club on ”Breadxit”: the debate over whether bread should be\nbanned from Europe\nExtracurricular activities\nProcrastinators Anonymous: Machine Learning for Laziness\nNovember 2015\nSuccessfully delayed attending the course\nRome, Italy\nDeveloped an AI that predicts the perfect moment to start binge-watching Dr. House episodes instead\nof working on important tasks.\nDumb Literature Club: Famous Books with Ridiculous Twists\nJune 2014 - Present\nProud Member\nPopejoy, Iowa\nRegularly participate in discussions concerning famous literature works, such as ”The Great Catsby”,\nwhich is basically the Great Gatsby, but with cats.\nTechnical skills\nProgramming Languages/Tools\nC, C++, Java, Javascript, Python, Prolog, LATEX, Pigeon-\nScript (for bird-based memes)\nLanguage proficiencies\nEnglish\nFluent in Shakespearean insults\nFrench\nProficient in baguette related jokes\nPortfolio of most relevant projects\nSurvey\nAnalyzing the effects of replacing office chairs with unicycles on employee morale\nSurvey\nInvestigation of the therapeutic effects of watching cat videos for 8 hours a day\nPaper\nThe correlation between sock loss in laundry and the existence of parallel universes\nArticle\nThe definitive study on the impact of pineapple as a pizza topping on global diplomacy\nMemberships\nCouch Potatoes Anonymous\nA support group for those addicted to binge-watching TV\nshows\nProcrastinators’ Club\nA group that will eventually get around to doing something,\nsomeday\n",
  "jake_ryan.pdf": "Jake Ryan\n123-456-7890 | jake@su.edu | linkedin.com/in/jake | github.com/jake\nEducation\nSouthwestern University\nGeorgetown, TX\nBachelor of Arts in Computer Science, Minor in Business\nAug. 2018 – May 2021\nBlinn College\nBryan, TX\nAssociate’s in Liberal Arts\nAug. 2014 – May 2018\nExperience\nUndergraduate Research Assistant\nJune 2020 – Present\nTexas A&M University\nCollege Station, TX\n• Developed a REST API using FastAPI and PostgreSQL to store data from learning management systems\n• Developed a full-stack web application using Flask, React, PostgreSQL and Docker to analyze GitHub data\n• Explored ways to visualize GitHub collaboration in a classroom setting\nInformation Technology Support Specialist\nSep. 2018 – Present\nSouthwestern University\nGeorgetown, TX\n• Communicate with managers to set up campus computers used on campus\n• Assess and troubleshoot computer problems brought by students, faculty and staff\n• Maintain upkeep of computers, classroom equipment, and 200 printers across campus\nArtificial Intelligence Research Assistant\nMay 2019 – July 2019\nSouthwestern University\nGeorgetown, TX\n• Explored methods to generate video game dungeons based off of The Legend of Zelda\n• Developed a game in Java to test the generated dungeons\n• Contributed 50K+ lines of code to an established codebase via Git\n• Conducted a human subject study to determine which video game dungeon generation technique is enjoyable\n• Wrote an 8-page paper and gave multiple presentations on-campus\n• Presented virtually to the World Conference on Computational Intelligence\nProjects\nGitlytics | Python, Flask, React, PostgreSQL, Docker\nJune 2020 – Present\n• Developed a full-stack web application using with Flask serving a REST API with React as the frontend\n• Implemented GitHub OAuth to get data from user’s repositories\n• Visualized GitHub data to show collaboration\n• Used Celery and Redis for asynchronous tasks\nSimple Paintball | Spigot API, Java, Maven, TravisCI, Git\nMay 2018 – May 2020\n• Developed a Minecraft server plugin to entertain kids during free time for a previous job\n• Published plugin to websites gaining 2K+ downloads and an average 4.5/5-star review\n• Implemented continuous delivery using TravisCI to build the plugin upon new a release\n• Collaborated with Minecraft server administrators to suggest features and get feedback about the plugin\nTechnical Skills\nLanguages: Java, Python, C/C++, SQL (Postgres), JavaScript, HTML/CSS, R\nFrameworks: React, Node.js, Flask, JUnit, WordPress, Material-UI, FastAPI\nDeveloper Tools: Git, Docker, TravisCI, Google Cloud Platform, VS Code, Visual Studio, PyCharm, IntelliJ, Eclipse\nLibraries: pandas, NumPy, Matplotlib\n",
  "jan_kusters.pdf": "JAN KüSTER RESUME\nConsultant and Software Developer\nStatus: M.Sc. Digital Media, Scientiﬁc Employee\nBremen, Germany\nFields: Software Engineering, Consulting, Scrum, Usability\nwww.jankuester.com\nTechs: Meteor, Javascript, Mongo,. Bootstrap, Bash, Git, Webstorm\ninfo@jankuester.com\nActivities: Global Game Jam, Open Source, Fitness\n+49 176 *** *** **\nSummary\nDigital media graduate with project experience in the ﬁeld of technology based assessment. Currently working\nas IT Consultant at We4IT, Bremen in the ﬁeld of IBM Notes Domino and XPages applications. Master studies\nfocused on teams from diﬀerent disciplines and cultural backgrounds on solutions for complex problems.\nExperience\nScientiﬁc Employee / PhD Student - University of Bremen\n2016 - present\n· Develop and evaluate the next generation learning management system with Meteor\n· Deﬁne a new level of software for classroom management based on an extensive nursing curriculum.\nIT Consultant for IBM XPages and Notes Domino - We4IT GmbH Bremen\n2014 - 2016\n· Realize projects in XPages and We4IT Aveedo, monitor project status, conduct reports\n· Implement the frontend for a BPMN compatible engine within We4IT Aveedo\nScientiﬁc Employee / Software Development - University of Bremen\n2012 - 2014\n· Invented a ﬂexible assessment framework, targeting industrial trainees\n· Supervised software development lifecycle, Recruited team members\nProject Management Simulation Training - Getoq Consulting\n2011 / 11\n· Performed a two-day project simulation from management perspective\n· Topics included customer contracts, change management, controlling, operational tasks\nStudent Assistant / Programmer - otulea.uni-bremen.de\n2010 - 2011\n· Realized an online diagnosis platform for workforce literacy development (Flex)\n· Modeled software design, implemented various prototypes, conducted usability tests\nEducation\nGraduated as M.Sc. Digital Media - University of Bremen\n2015 / 07\n· Master Thesis: Semi Automated Scoring in Technology Based Assessment\n· Developed and evaluated an algorithm for semi automated scoring of spreadsheet data\nMaster Project - PrIMA - University of Bremen\n2012 - 2013\n· Co-Invented a touch table application for medical support, co-developed software (Java)\n· Formed a scrum team, mainted project dev server (Debian), surveyed target audience\nMaster Studies Digital Media - University of Bremen\n2012 - 2015\n· Inter-cultural classes in English, covering special topics in computer science and design\n· Professionalized in research methods, software development and e-assessment\nSemester Abroad - University of Melbourne\n2009 - 2010\n· Mastered six months of study and trans-cultural experience in Melbourne, Australia\n· Finished machine programming, information visualization, professional essay writing\nwww.jankuester.com · github.com/jankapunkt\n",
  "john_miller.pdf": "John Miller\nProfile Summary\nExperienced Data Analyst with\nover 5+ years of expertise in\nSQL,Python, Excel, Power BI,\nPower BI Service, T-SQL, Birt\nReporting tool, and Kibana.\nProficient in data manipulation,\nstatistical analysis, and data\nvisualization. Skilled in data\ncollection, cleansing, analysis,\nand creating insightful visual\nreports to support data-driven\ndecision-making. Strong\ncommunicator with a track record\nof translating complex data into\nactionable business insights.\nContact details\n@ XXXXXXX@gmail.com\nH +91 00 00 00 00 00\nB XXXXXXXXXXXXX\nPersonal information\nCitizenship: Indian\nFamily: Married with children\nLanguages: English, Hindi, Telugu\nSkills\n• SQL, SSMS, Power BI,Power BI\nService, DAX Functions,\nTableau, Python, PySpark\n• Panda, Numpy, Warehouse,\nAzure Databricks\n• Microsoft Excel, MS Word,MS\nPowerPoint\n• SQL Server, T-SQL,\nKibana,Eclipse Birt,ETL\n• JavaScript, HTML, GitHub\n• Communication and team\ncollaboration\nExperience\nData analyst at XXXX (Hyderabad).\n2018.08–2024.05\n⋄Collected, cleaned, and processed large datasets from multiple sources to\nensure data accuracy and integrity.\n⋄Conducted exploratory data analysis to identify patterns, trends, and\ninsights using statistical methods and data visualization techniques to\nsupport business decisions.\n⋄Maintained automated data pipelines for efficient data extraction, trans-\nformation, and loading (ETL) processes using SQL and Python\n⋄Created interactive dashboards and reports using Power BI, DAX Function\nand Power BI Service to visualize key performance indicators (KPIs) and\ncommunicate findings to stakeholders\n⋄Collaborated with cross-functional teams to define project requirements,\nanalyze business problems, and develop data-driven solutions. Conducting\nad-hoc analysis and insights to support strategic initiatives and business\nobjectives.\n⋄Conducted data quality assessments and implemented data governance\npolicies to ensure data accuracy, consistency, and compliance.\n⋄Create complex SQL queries using UNION and UNION ALL, Join’s, GROUP BY,\nWHERE, and HAVING conditions for report and dashboard creation. Optimize\nSQL queries and create stored procedures, views, functions, and indexes.\nCreated temp tables, CTEs, and variables for data manipulation.\n⋄Having good experience on T-SQL, Microsoft SQL Server Management Studio.\nSolid knowledge of database management systems and data warehousing\nconcepts.\n⋄Having good knowledge creating Relationships in data model like one-one,\none-many, many-one and many-many. Monitoring and validating key metrics\ninsights data from daily report.\nEducation\nMaster of Computer Application (MCA). from JNTU Kakinada\nUniversity.\n2012–2015\nBachelor of Science in Mathematics, Physics, and Computer\nScience. Acharya Nagarjuna University.\n2007–2010\nCertifications\n⋄Introduction to Data Analysis using Microsoft Excel, Coursera.\n⋄Data Analysis With Python,Cognitive Class DA0101EN, provided by IBM.\nJuly-3-2024\n⋄SQL, Hacker Rank\nHobbies\nListening Music, Playing Cricket\n",
  "jon_doe.pdf": "John Doe\njohn.doe@example.com | 111.111.1111\nEXPERIENCE\nCOMPANY A | ADVANCED DEVELOPMENT INTERN\nMay 2018 – Aug 2018 | Somewhere, XX\n• Developed a cloud-based solution to automate and enhance the\nengineering process for network installation using AWS and Python.\n• Worked with other teams to create a system to collect and visualize\ntelemetry data of network elements in real time using AWS, Python,\nand DOMO.\n• Consulted with other teams to jump start cloud-technology adoption\nand solutions throughout the company.\n• Contributed to initial planning for optics-alignment system utilizing\nAWS, reinforcement learning, and an IoT architecture.\nCOMPANY B | INTERN\nFeb 2017 – Nov 2017 | Somewhere, XX\n• Coordinated with multiple departments to lead a software product\nevaluation resulting in a ﬁt-for-purpose verdict and provided a\nrecommendation on moving forward.\n• Organized meetings with the vendor to receive in-depth product\ninformation and answers to cross-departmental questions.\n• Participated on the Web Development Taskforce to provide\nAngularJS sites to internal customers.\n• Participated in an internal CodeJam to prototype a blockchain\napplication for managing a model supply-chain.\n• Worked with a team to plan executive visit and team-building\nexercise for 200 employees.\nMY UNIVERSITY ITS | ASSISTANT SUPPORT SPECIALIST\nAug 2015 – Oct 2016 | Somewhere, XX\n• Interacted with clients to assess their problems and implement a\nsolution in an efﬁcient, friendly manner.\n• Prepared workstations and laptops for future use by company\nemployees.\n• Created scripts to automate common tasks and increase productivity.\nPROJECTS\nSPACE ROBOTICS TEAM | PATH-PLANNING LEAD\nJan 2018 – Present | Somewhere, XX\n• Spearhead the development effort for the path-planning functionality\nof a team of three robots.\n• ROS provides movement servers and the planning is being\nimplemented in Python to allow for fully-autonomous operation.\nCHIT CHAT | CLASS PROJECT FOR DISTRIBUTED CLIENT-SERVER\nPROGRAMMING\nJan 2018 – May 2018 | Somewhere, XX\n• Lead the development of Chit Chat, an anonymous chat application\ncreated as a class project.\n• Chit Chat provides real-time communication while utilizing a PHP\nbackend and AngularJS frontend.\nEDUCATION\nMY UNIVERSITY\nBACHELOR OF SCIENCE IN\nCOMPUTER SCIENCE WITH MINORS IN\nMATHEMATICS AND STATISTICS\nExpected Dec 2019 | Somewhere, XX\nDean’s List (All Semesters)\nCum. GPA: 4.0 / 4.0\nSKILLS\nPROGRAMMING\n3+ years:\nPython • C/C++\n1+ years:\nPHP • JavaScript\n0+ years:\nMatlab • R • SAS\nTECHNOLOGY\nGit/Github • AWS • Linux\nUNIX • Windows • ROS\nArtiﬁcial Intelligence • Automation\nCOURSEWORK\nGRADUATE\nAnalysis of Algorithms\nUNDERGRADUATE\nArtiﬁcial Intelligence\n(Teaching Assistant)\nAI Robotics\nOperating Systems I\nCalculus I-IV\nData Analysis I\nIntroduction to Probability\nSOCIETIES\nAssociation for Computing Machinery\n(ACM)\nScrum Alliance Certiﬁed ScrumMaster\nUniversity Honors College\nNational Merit Scholarship Finalist\nLINKS\nGithub:// JohnDoe\nLinkedIn:// johndoe\n",
  "rohan_resume.pdf": "Rohan Kumar Thawait\n+91-8305023320\nRoll No.:2420289\nthawaitrohan@gmail.com\nM.Tech - Computational and Data Science\nrohanthawait.242cd021@nitk.edu.in\nB.Tech in Computer Science and Engineering\nGithub | GFG | Leetcode\nNational Institute Of Technology Karnataka, Surathkal\nLinkedin\nEducation\nDegree/Certificate\nInstitute/Board\nCGPA/Percentage\nYear\nM.Tech.\nNational Institute Of Technology Karnataka, Surathkal\n8.08 (Current)\n2024-Present\nB.Tech.\nSAGE University, Indore\n8.12\n2024\nSenior Secondary\nCBSE Board\n83.0%\n2019\nSecondary\nCBSE Board\n9.2\n2017\nProjects\nResume Screening Assistant: GenAI x Backend Engineering\n• Built a system that parses unstructured resumes and matches them to job descriptions using LLMs.\n• Used OpenAI GPT-4 API and Hugging Face models to extract and rank skills from PDF and DOCX resumes.\n• Backend built using FastAPI with structured outputs and REST interface Stored embeddings and match scores\nfor quick querying.\n• Optimized the model through hyperparameter tuning, improving classification performance.\n• Deployable as a microservice.\nLLM-Powered Q&A Bot for PDFs(RAG System)\n• Built a document-querying tool where users upload long legal/property documents and ask questions.\n• Used LangChain, FAISS, and OpenAI to generate answers based on extracted chunks.\n• Converted PDFs to chunks, created embedding store, used similarity search before prompting LLM.\nMicro-Doppler Based Image Classification\n• Developed a binary classification model to distinguish between drone and bird micro-Doppler signatures captured\nfrom radar.\n• Explored various deep learning architectures, including CNNs, ResNet50, and Vision Transformers.\n• Improved model performance by optimizing data preprocessing and hyperparameter tuning.\nTechnical Skills\n• Languages:Python, SQL\n• Backend & Engineering::FastAPI, REST APIs, GitHub Actions, MySQL, Docker\n• AI/ML & NLP: Hugging Face Transformers, OpenAI API, Prompt Engineering, LangChain, Text Summarization,\nClassification, Named Entity Recognition\n• LLM Tools & GenAI:Embedding-based retrieval, Few-shot prompting, Zero-shot classification, Vector DBs\n• DevOps:: Render, GitHub Actions, Docker\n• Version Control & Tools:Git, GitHub, VS Code, Google Colab\n• ML/DL Libraries:TensorFlow, Keras, Scikit-learn\nKey Courses Taken\n• Computer Science:Operating Systems, Database Management Systems, Data Structures and Algorithms,\nComputer Networks, Machine Learning\n• Mathematics & Statistics:Linear Algebra, Probability and Statistics, Bayesian Decision Theory\n• Software Development:Object-Oriented Programming, Software Engineering\nAchievements\n• Certified LLM Agent Builder — Hugging Face GAIA Benchmark Pass\n• Solved 500+ problems on LeetCode and GFG, with 100+ days consistency\n",
  "satoru_gojo.pdf": "Satoru Gojo\nTokyo Prefectural Jujutsu High School • Minato City, Minamiaoyama, 5-7-2 • Tokyo, Japan 107-0062\nQ sgojo@jjk.edu.jp 7 @sgojo  sgojo.jjk.com | Updated: July 14, 2024\nCurrent Position\nTokyo Prefectural Jujutsu High School\nTokyo, Japan\nFaculty\nJul. 2010 - Present\nEducation\nTokyo Prefectural Jujutsu High School.\nTokyo, Japan\nSpecial Grade Jujutsu Sorcerer\nJul. 2006 - 2010\n• Trait and Technique: The Six Eyes (Rikugan), Limitless (Mukagen), Infinity (Mugen).\n• Cursed Technique: Cursed Technique Lapse: Blue (Jutsushiki Junten Ao), Cursed Technique Reversal: Red\n(Jutsushiki Hanten Aka), Hollow Technique: Purple (Kyoshiki Murasaki).\n• Domain Expansion: Unlimited Void (Muryokusho).\nProject\nFight against Ryomen Sukuna\nMain Challenger\nJun. 2023 - Present\n• The complete incapacitation of the target is caused by a phenomenon where the target will be able to see and\nfeel everything while not being able to see or feel anything at the same time.\n• All the actions one has taken in their life is forced upon them infinitely and they can’t do anything but die\nslowly, though this effect does not affect Gojo or anyone he’s touching.\n• Even though his title of ’The Strongest’ is self-proclaimed, most allies and enemies alike never actually dispute\nthe title and consider him one of the most dangerous people alive.\nMy Dress-Up Darling\nOutfit to Yuta Okkotsu\nMay 2024 - Present\n• Okkotsu is barely alive and Rika is able to take him to Ieiri’s team, when he decides to go forward with his prior\nagreement with Gojo to use Kenjaku’s technique and take over Gojo’s corpse to fight Sukuna again, saving Yuji\nand Todo from the latter’s Domain Expansion, by initiating Gojo’s.\n• After several exchanges, Gojo defeats all of the Ten Shadows that Sukuna used and greatly injures him, but ends\nup being killed by Sukuna’s new World Cutting technique and finds himself talking with Geto and his other late\nfriends. Gojo’s corpse is then used by Okkotsu with Kenjaku’s technique, as per their previous agreement.\nMisc\nVoiced by: Yuichi Nakamura, Mariya Ise (young) (Japanese); Kaiji Tang, Cristina Vee (young) (English).\nStudents: Yuji Itadori, Yuta Okkotsu.\nSatoru Gojo - CV\n1/1\n",
  "sparky_sundevil.pdf": "SPARKY SUNDEVIL8\n123-456-7890 • sdevil123@asu.edu • linkedin.com/in/sparkysundevil • github.com/sparkysundevil\nSUMMARY\nSenior mechanical engineering student with internship experience in medical device manufacturing and product devel-\nopment. Project experience includes applications of software and hardware. Seeking full-time position May 2020 in\nmedical device manufacturing, pharmaceutical production, and other FDA-regulated industries.\nEDUCATION\nB.S.E., Mechanical Engineering\nGraduating May 2020\nArizona State University, Tempe, AZ\n3.82 GPA\nBarrett, The Honors College\nRelevant coursework: Hardware Design Languages and Programmable Logic, Advanced Excel in Business\nTECHNICAL SKILLS\nData Analysis and Statistics: JMP, Minitab\nDesign and Modeling Tools: SOLIDWORKS, LabVIEW, MATLAB, Microsoft Office\nProgramming: Python, C, C++\nCertifications: National Instruments Certified LabVIEW Associate Developer (CLAD) – August 2019\nPROFESSIONAL EXPERIENCE\nStryker Solutions, Phoenix, AZ: Research & Dev Development Intern\nMay 2019 – Aug 2019\n• Applied measurement system analysis (MSA) to qualify relocated test equipment (JMP, Python)\n• Authored three technical reports for relocated packaging equipment, following IQOQPQ guides (JMP, Excel)\nMed Apps, Scottsdale, AZ: Quality Engineering Intern\nMay 2018 – Aug 2018\n• Assessed equivalency of proposed alternate plastic packaging material (Minitab, Excel)\n• Created and delivered presentations to train field sales representatives on new product features (PowerPoint)\nACADEMIC PROJECTS\nHand Cycle for Polio Victims\nFall 2019 – Spring 2020\nCollaborated in a team of three to design model of custom hand cycle for polio victims (SOLIDWORKS).\n• Developed team schedule, including quality measurement for each major milestone (Microsoft Project)\n• Ensured team compliance to Design Control Procedures according to Code of Federal Regulations (CFR)\n• Recognized by faculty audience as “Best Presentation” out of 15 teams\nSensor for Quadriplegic Patients\nSpring 2019\nLed team of three to design and develop a mouse-like device to allow quadriplegic patients to use websites.\n• Assessed range-of-motion data to determine feasible solutions (Python)\n• Created device to detect muscle flexion in neck to control the mouse click (Arduino, FPGA)\nOTHER WORK EXPERIENCE\nArizona State University, Tempe, AZ: Tutor (10 hours/week)\nAug 2018 – May 2019\n• Tutored 10-15 undergraduate engineering students per week in MATLAB programming and math coursework\nKohl’s, Gilbert, AZ: Sales Associate, Jewelry Department (16-24 hours/week)\nAug 2017 – Dec 2017\n• Achieved #2 highest selling associate within one month of hire date\nACTIVITIES\nASU Society of Women Engineers (SWE)\nAug 2017 – Present\nMultiple leadership roles, including vice-president and industry relations chair (300 members, $75k annual budget)\n• Tutored 10-15 undergraduate engineering students per week in MATLAB programming and math coursework\n• Organized 2018 annual conference participation, including 8 student poster submissions\n",
  "tushar_mehra.pdf": "Tushar Verma\n +91-7067324323\nM.Tech (CSE), National Institute of Technology, Surathkal\nï LinkedIn Profile\ntusharverma.232cs036@nitk.edu.in\nEducation\n•National Institute of Technology, Surathkal\n2023-Current\nM.Tech Computer Science\nCGPA: 7.98\n•Indore Institute of Science and Technology\n2019-2023\nB.Tech Computer Science\nCGPA: 8.8\n•Shri Barfani Academy\n2019\nSenior Secondary (XII), Science, MPBSE board\nPercentage: 87.4\nExperience\n•Betaque Solutions (Link)\nDecember’21 - July’22\nSolution Engineer\nIndore\n– Specialized in creating responsive and interactive websites using the MERN stack. Exhibited front and back-end\ndevelopment proficiency, ensuring seamless integration and user experience.\n– Designed Betaque Solutions’ official website, successfully delivered customized websites for three external clients,\nand Led the development of a quiz application.\nExecuted best practices for code optimization, security, and\nscalability, contributing to the overall improvement of development processes within the organization.\nPersonal Projects\n•Automated Knee Dysfunction Detection from MRI Images Using CNN Methods\nJan’2024 - Ongoing\n– Tech Stack Used: Deep Learning, Python, TensorFlow, Keras, Stanford University Dataset, Private Hospital\nDataset\n– Implemented and analyzed deep learning CNN models from various research papers to detect Knee Dysfunction\nwith MRI images. Based on those papers, achieved the highest accuracy of 78%. Further, a private dataset from an\nIndian hospital will be incorporated to improve model accuracy and get the best model for optimal performance.\n•AQM Evaluation Suite\nMarch’2024 - April’2024\n– Tech Stack Used: NeST (Network Simulation Tool), AQM Algorithms\n– We created and implemented an architecture for evaluating various AQM algorithms, enabling comparative analysis\nunder 27 scenarios and at least five metrics to calculate for each. The system effectively tested multiple algorithms\nwithin one scenario, showcasing proficiency in network simulation and algorithm evaluation.\n•Career Guidance System with Chatbot (ZOZO) (Link)\nAug’2022 - Nov’2022\n– Tech Stack Used: Web development, Machine Learning (Fuzzy Logic, various ML libraries)\n– We developed a web-based career guidance system that uses machine learning to analyze user responses and suggest\noptimal career fields based on interests. We also displayed web development and machine learning proficiency\nby creating a personalized career guidance platform. The system analyzes user inputs to provide tailored career\nrecommendations, showcasing an advanced understanding of ML applications and commitment to user experiences.\nThe model had an accuracy of 84% regardless of the number of questions.\n•Online Quiz App (QuizDOM)\nMay’2022 - July’2022\n– Tech Stack Used: MERN stack, Firebase\n– We created a quiz application that allows real-time tracking of quiz progress and automatic saving of answers. The\nadmin dashboard provides comprehensive management tools, and response tables enable detailed analysis of quiz\nresults, making it easy for students and teachers to get valuable insights.\n•Driver Drowsiness Detection System (D-Cube) (Link)\nFeb’2022 - Apr’2022\n– Tech Stack Used: Python, OpenCV, dlib\n– We exhibited proficiency in Python by developing a driver drowsiness detection system that enhances road safety.\nThe system effectively monitors driver alertness using advanced face detection techniques, showcasing an innovative\napproach to reducing accidents.\n•Other Web Dev Projects:(Click on names)\n– Socially Active, UltraBuildings, ReadyDeals\nTechnical Skills and Interests\nLanguages: C, C++, Python\nDeveloper Tools: Git\nFrameworks: React, Node.js, Express, TensorFlow, Keras\nCloud/Databases: MongoDB, Firebase\nSoft Skills: Leadership, Team collaboration, Communication\nCoursework: Machine Learning, Deep Learning, Web Development, Data Structures and Algorithms\nAreas of Interest: Machine Learning, Deep Learning, Full Stack\nPositions of Responsibility\n•Position : Placement Coordinator (M.Tech CSE, Career Development Cell)\n2024-25\n•Position : President, (Music Club,AI/ML)\n2022-23\nAchievements\n• Achieved AIR 1137 from among 1,20,000 students applying in the first attempt.\n2023\n• Qualified for NDA exam and selected for SSB on the first attempt with ranking in the top 100 in Mathematics2019\n• Smart India Hackathon Finalist being 1st Runner-up in the Finals\n2022\n• Kabbadi, Table Tennis and Badminton Regional Player, with Gold and Bronze Medals\n2018\n",
  "xian_yuin.pdf": "(+00) 111-2222-3333\nyuanhf@example.com\nhttp://www.example.com\nXIAO YUAN\nPH.D.\nEducation\nDepartment of Automation, Tsinghua University\nBeijing, China\nPh.D. in Control Science and Engineering\n2022 - 2028 (expected)\n• Advisor: Prof. Xiao Yuan\n• Research area: Operations Research and Machine Learning\nDepartment of Precision Instrument, Tsinghua University\nBeijing, China\nB.E. in Measurement and Control Technology and Instrument\n2018 - 2022\n• GPA: 0.00/4.00, Rank: 64/64.\nPublications\n1. Xiao Yuan, Hua Li. The Future Urban Transportation Systems: Innovations and Chal-\nlenges. Journal of Operations Research and Optimization, 2024.\n2. Hua Li, Xiao Yuan, John Doe. Optimizing Logistics and Supply Chain Networks Using\nMachine Learning Techniques. International Conference on Operations Research and\nMachine Learning, 2023.\n3. John Doe, Xiao Yuan, Hua Li. Artificial Intelligence in Healthcare: Transforming Diag-\nnostics and Treatment. International Conference on HealthTech Innovations, 2023.\nProjects\nAdvanced Optimization Techniques for Smart Grid Management\nNational Natural Science Foundation of China (NSFC)\n2023.01 - 2024.01\nOptimizing Urban Traffic Flow Using AI-Based Predictive Models\nSmart Transportation Innovations Grant\n2021.12 - 2022.12\n.\nInternships\nABC Tech Ltd. | Shanghai, China\n2024.01 - 2024.06\n• Develop engaging content for social media platforms.\n• Prepare reports and presentations summarizing research findings.\nXYZ Tech Inc. | Shanghai, China\n2023.07 - 2023.12\n• Develop engaging content for social media platforms.\n• Prepare reports and presentations summarizing research findings.\nAwards\nand\nHonors\n• First Prize, International Data Science Challenge\n2023.11\n• Best Innovation Award, Tech Startup Pitch Competition\n2023.05\n• Excellence in Research Award, Annual Research Symposium,\n2022.12\n• Academic Scholarship, Tsinghua University\n2022.09\nSkills\nLanguages: Chinese, English, French.\nProgramming: Python, C++, MATLAB.\nAcademic\nServices\nReviewers for: Journal of Operations Research and Optimization,\nInternational Conference on Optimization and Machine Learning,\n...\n1\n"
}